<a href="https://colab.research.google.com/github/jonnie763/DATA-690-WANG/blob/master/Jonathan_Rius_Assignment_6_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

##1.Use Pandas read_html() function to retrive the HTML tables as dataframes from the web page: https://www.genealogybranches.com/censuscosts.html

In [ ]:
import pandas as pd # Same outcome as assignment #4 except using pandas 
df_list = pd.read_html("https://www.genealogybranches.com/censuscosts.html") # Code used to read the html

##2. Find out how many HTML tables Pandas retrieves from the web page. Find out which dataframe contain the data and use it for further processing.

In [ ]:
df_list = pd.read_html("https://www.genealogybranches.com/censuscosts.html")
len(df_list) # Same code as before we are using this fugure out the number of tables in the data set there are 2

2

In [ ]:
df1 = df_list[0] # Looking through tables to see the one the contains the data, [0] does [1] does not 
df1.head()       # First five rows using df1.head

             0                 1            2                        3
0  Census Year  Total Population  Census Cost  Average Cost Per Person
1         1790           3929214      $44,377               1.13 cents
2         1800           5308483      $66,109               1.24 cents
3         1810           7239881     $178,445               2.46 cents
4         1820           9633822     $208,526               2.16 cents

In [ ]:
df2 = df_list[1] # [1] Does not contain relevant data use [0]
df2.head()       # First five rows using df1.head only one row shows up

                                                   0
0  The U.S. population reached 300,000,000 on 17 ...

##3. Display and explore the data (rows, columns, etc.) and determine the data quality (bad rows, bad columns, bad elements, null values, etc.)

In [ ]:
df1 # Looks at all rows, to get an idea of what needs cleaning, many points where data needs to be cleaned such as symbols like "*""

              0                 1               2                        3
0   Census Year  Total Population     Census Cost  Average Cost Per Person
1          1790           3929214         $44,377               1.13 cents
2          1800           5308483         $66,109               1.24 cents
3          1810           7239881        $178,445               2.46 cents
4          1820           9633822        $208,526               2.16 cents
5          1830          12866020        $378,545               2.94 cents
6          1840          17069458        $833,371               4.88 cents
7          1850          23191876      $1,423,351               6.14 cents
8          1860          31443321      $1,969,377               6.26 cents
9          1870          38558371      $3,421,198               8.87 cents
10         1880          50155783      $5,790,678              11.54 cents
11         1890          62979766     $11,547,127              18.33 cents
12         1900          76303387     $11,854,000              15.54 cents
13         1910          91972266     $15,968,000              17.07 cents
14         1920         105710620     $25,117,000              23.76 cents
15         1930         122775046     $40,156,000              32.71 cents
16         1940         131669275     $67,527,000              51.29 cents
17         1950         151325798     $91,462,000              60.44 cents
18         1960         179323175    $127,934,000              71.34 cents
19         1970         203302031    $247,653,000                    $1.22
20         1980         226542199  $1,078,488,000                    $4.76
21         1990         248718301  $2,492,830,000                   $10.02
22         2000         281421906    $4.5 Billion                   $15.99
23        2010*         308745538     $13 Billion                   $42.11

In [ ]:
df1.columns # Number of columns is 4

Int64Index([0, 1, 2, 3], dtype='int64')

In [ ]:
df1.shape  # Number of rows and columns is 24 and 4 respectively

(24, 4)

In [ ]:
first_row = df1.iloc[0] # Checks the first row 
first_row

0                Census Year
1           Total Population
2                Census Cost
3    Average Cost Per Person
Name: 0, dtype: object

In [ ]:
df1.columns = first_row # First row repeats twice  
df1.head()              # First five rows using df1.head

0  Census Year  Total Population  Census Cost  Average Cost Per Person
0  Census Year  Total Population  Census Cost  Average Cost Per Person
1         1790           3929214      $44,377               1.13 cents
2         1800           5308483      $66,109               1.24 cents
3         1810           7239881     $178,445               2.46 cents
4         1820           9633822     $208,526               2.16 cents

In [ ]:
df1.info() # Determines null values, there are no "null" values meaning missing data is not a problem

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24 entries, 0 to 23
Data columns (total 4 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Census Year              24 non-null     object
 1   Total Population         24 non-null     object
 2   Census Cost              24 non-null     object
 3   Average Cost Per Person  24 non-null     object
dtypes: object(4)
memory usage: 896.0+ bytes

In [ ]:
df1.drop([0], inplace=True) # Drops first row for cleansing 
df1.head()                  # First five rows using df1.head

0 Census Year Total Population Census Cost Average Cost Per Person
1        1790          3929214     $44,377              1.13 cents
2        1800          5308483     $66,109              1.24 cents
3        1810          7239881    $178,445              2.46 cents
4        1820          9633822    $208,526              2.16 cents
5        1830         12866020    $378,545              2.94 cents

##4. Document the data quality issues using a Markdown cell so the reader understands what the problems are.

##There are no missing values, however one looks at the dataframe as a whole, there are symbols that needs to be cleansed per column. This includes * symbols, cents and $ symbols. The population column appears to be just fine as the commas from the previous assisgnment seemed to be removed automatically. **There is no need to cleanse the population column.**

##5. Write a function named cleanse_year() that takes a string as input and removes any asterisks in the string and return the cleansed string. Test the function by using test strings (for example, "1989*", "20*10")

In [ ]:
def cleanse_pop(raw_pop):    # define function for removing string of *
    return raw_pop.replace("*", "")

In [ ]:
raw_pop1 = "123456*"        # Test the function, function works to remove *
cleanse_pop(raw_pop1)

'123456'

##6. Cleanse the column "Census Year" using the function cleanse_year() and Pandas's apply() function.

In [ ]:
df1["Census year "] = df1["Census Year"].apply(cleanse_pop) # Apply cleanse function for the column census year, column is then removed of *
df1["Census year "]

1     1790
2     1800
3     1810
4     1820
5     1830
6     1840
7     1850
8     1860
9     1870
10    1880
11    1890
12    1900
13    1910
14    1920
15    1930
16    1940
17    1950
18    1960
19    1970
20    1980
21    1990
22    2000
23    2010
Name: Census year , dtype: object

##7. Repeat this process for column "Total Population", "Census Cost", "Average Cost Per Person". (define, test, and apply the function)

In [ ]:
def cleanse_cost(raw_cost):                     # This function is more complex as the final two rows, need to be stated with all numbers stated 
    cost = raw_cost.lstrip("$").replace(",","") # Remove commas and dollar symbols 
    if  raw_cost.find("4.5") != -1:             # This is in reference to the last two rows, essentially two conditions are set to make the billions show all numbers
        cost = "45" + "0" * 8
    elif raw_cost.find("Billion") != -1:        # This is for the last row, to show all numbers 
        cost = "13" + "0" * 9
    return cost                                 # Return the end result, function is ready to be used

In [ ]:
raw_cost = "$9,999"         # Test function, it works in this instance to remove string 
cleansed = cleanse_cost(raw_cost)
print(cleansed)              # Prints string

9999

In [ ]:
df1["New Census cost"] = df1["Census Cost"].apply(cleanse_cost) # Apply cleanse function for the column census year, column is then removed of necessary string 
df1["New Census cost"]

1           44377
2           66109
3          178445
4          208526
5          378545
6          833371
7         1423351
8         1969377
9         3421198
10        5790678
11       11547127
12       11854000
13       15968000
14       25117000
15       40156000
16       67527000
17       91462000
18      127934000
19      247653000
20     1078488000
21     2492830000
22     4500000000
23    13000000000
Name: New Census cost, dtype: object

In [ ]:
def cleanse_cost_avg(raw_avg):                        # Define function for cents, two strings need to be removed    
                         
    if raw_avg.find("cents") != -1:                   # Remove cents using conditional statements, replacing string with blank 
        new_avg = raw_avg.replace("cents", "")
    elif raw_avg.find("$") !=-1:
        new_avg =raw_avg.lstrip("$").replace(".","")  # Upon further inspection, the avg cost column was not in the appropriate units, chose to apply more conditions to have the column share the same units (cents) 
    else:
        new_avg = raw_avg

    return new_avg                                    # Return the end result, function is ready to be used

In [ ]:
raw_avg = "2.16 cents"   # Test function, it works in this instance to remove strings 
cleansed = cleanse_cost_avg(raw_avg)
print(cleansed)          # Prints string

2.16

In [ ]:
raw_avg = "$ 2.16 "   # Test function, it works in this instance to remove strings 
cleansed = cleanse_cost_avg(raw_avg)
print(cleansed)          # Prints string

 216

In [ ]:
df1["New Avg Cost Per Person (In cents)"] = df1["Average Cost Per Person"].apply(cleanse_cost_avg) # Apply over the cleansing function from above to appropriate column ( Average Cost per person)
df1                                                                                                # Cleansed columns and uncleansed together looks unorganized

0  Census Year  ... New Avg Cost Per Person (In cents)
1         1790  ...                              1.13
2         1800  ...                              1.24
3         1810  ...                              2.46
4         1820  ...                              2.16
5         1830  ...                              2.94
6         1840  ...                              4.88
7         1850  ...                              6.14
8         1860  ...                              6.26
9         1870  ...                              8.87
10        1880  ...                             11.54
11        1890  ...                             18.33
12        1900  ...                             15.54
13        1910  ...                             17.07
14        1920  ...                             23.76
15        1930  ...                             32.71
16        1940  ...                             51.29
17        1950  ...                             60.44
18        1960  ...                             71.34
19        1970  ...                                122
20        1980  ...                                476
21        1990  ...                               1002
22        2000  ...                               1599
23       2010*  ...                               4211

[23 rows x 7 columns]

In [ ]:

df1.drop(columns=['Census Year',"Census Cost","Average Cost Per Person" ])

0  Total Population  ... New Avg Cost Per Person (In cents)
1           3929214  ...                              1.13
2           5308483  ...                              1.24
3           7239881  ...                              2.46
4           9633822  ...                              2.16
5          12866020  ...                              2.94
6          17069458  ...                              4.88
7          23191876  ...                              6.14
8          31443321  ...                              6.26
9          38558371  ...                              8.87
10         50155783  ...                             11.54
11         62979766  ...                             18.33
12         76303387  ...                             15.54
13         91972266  ...                             17.07
14        105710620  ...                             23.76
15        122775046  ...                             32.71
16        131669275  ...                             51.29
17        151325798  ...                             60.44
18        179323175  ...                             71.34
19        203302031  ...                                122
20        226542199  ...                                476
21        248718301  ...                               1002
22        281421906  ...                               1599
23        308745538  ...                               4211

[23 rows x 4 columns]

##8. After all columns are cleansed, save the clenased dataframe to a file named "census_cost_cleansed.csv" using CSV format.

In [ ]:
df1.drop(columns=['Census Year',"Census Cost","Average Cost Per Person" ])                                    # Cleansed data frame from before 
df1.drop(columns=['Census Year',"Census Cost","Average Cost Per Person" ]).to_csv('census_cost_cleansed.csv') # Convert into csv, checked and data was all cleansed